app/controllers/cers/courses_controller.rb

  def index
    @page = "online-courses-body"
    @courses = Cers::Course.salable.limit(4)
    @featured_books = Bookstore::Book.salable.limit(3)
    @featured_courses  = Cers::Course.salable.order('cers_products.featured DESC, cers_courses.id DESC').limit(4)
    @category_groups    = Cers::Group.where(:enabled => true, :domain_id => ApplicationController::DOMAIN_ID).order(:title).limit(7)
---
SELECT "cers_groups".* FROM "cers_groups" WHERE "cers_groups"."enabled" = 't' AND "cers_groups"."domain_id" = 4 ORDER BY cers_groups.order, title LIMIT 7