app/controllers/cers/teachers_controller.rb

    def index
      @page = "teachers-body"

      @teachers = Cers::Teacher.tagged_with("pcj").order(:name)
---
SELECT "tags".* FROM "tags" WHERE (lower(name) = 'pcj')