app/controllers/home_controller.rb

SELECT "tags".* FROM "tags" WHERE (lower(name) = 'pcj')
SELECT cers_courses.id, cers_courses.created_at, cers_courses.image_file_name, cers_courses.image_updated_at FROM "cers_courses" INNER JOIN cers_products ON cers_products.itemable_id = cers_courses.id INNER JOIN cers_product_domains ON cers_product_domains.cers_product_id = cers_products.id JOIN taggings courses_taggings_59e099c ON courses_taggings_59e099c.taggable_id = "cers_courses".id AND courses_taggings_59e099c.taggable_type = 'Cers::Course' AND courses_taggings_59e099c.tag_id = 4 WHERE (cers_products.itemable_type = 'Cers::Course' AND cers_products.enabled = 't' AND cers_product_domains.domain_id = 4) AND ('2013-11-25 20:37:11.493316' >= cers_products.started_at AND ('2013-11-25 20:37:11.493319' <= cers_products.ended_at OR cers_products.ended_at IS NULL)) ORDER BY cers_products.featured DESC, cers_courses.id DESC LIMIT 7
---
  def index
    set_meta_tags :title       => ApplicationController.domain.name,
                  :description => ApplicationController.domain.description,
                  :keywords    => ApplicationController.tag_list

    @teachers = load_main_teachers

    @banners  = ApplicationController.load_banners(ApplicationController::BANNER_CATEGORIES[:PRINCIPAL], :select => 'cms_banners.title, cms_banners.description, cms_banners.image_file_name, cms_banners.image_updated_at')
    @news_box = news_box

    @books    = Bookstore::Book.salable.tagged_with("pcj").limit(4)
    @featured_courses  = Cers::Course.salable.tagged_with("pcj").order('cers_products.featured DESC, cers_courses.id DESC').limit(7)